app/views/inventories/_form.html.erb

SELECT `currencies`.* FROM `currencies`
---
            <%= form.label :currency_id %>
            <%= form.select :currency_id, Currency.all.collect {|c| [c.name, c.id]}, {prompt: "Select Currency"}, class: "form-select form-select-lg" %>