app/views/budgets/_form.html.erb

            <%= form.label :currency_id, class: "form-label"  %>
            <%= form.select :currency_id, Currency.all.collect {|c| [c.name, c.id]}, {prompt: "Select Currency"}, class: "form-select form-select-lg" %>
---
SELECT `currencies`.* FROM `currencies`