app/views/vaccines/_form.html.erb

            <%= form.label :currency_id %>
            <%= form.select :currency_id, Currency.all.collect {|c| [c.name, c.id]}, {prompt: "Select Currency"}, class: "form-select form-select-lg" %>
---
SELECT `currencies`.* FROM `currencies`