app/controllers/bird_categories_controller.rb

  def index
    @bird_categories = BirdCategory.all
---
SELECT `bird_categories`.* FROM `bird_categories`

  def create
    @bird_category = BirdCategory.new(bird_category_params)

    respond_to do |format|
      if @bird_category.save
---
INSERT INTO `bird_categories` (`name`, `purpose`, `breed`, `created_at`, `updated_at`) VALUES ('Broilers', 'Meet', 'Exotic', '2022-04-20 14:01:26', '2022-04-20 14:01:26')

    def set_bird_category
      @bird_category = BirdCategory.find(params[:id])
---
SELECT  `bird_categories`.* FROM `bird_categories` WHERE `bird_categories`.`id` = 1 LIMIT 1