app/controllers/budgets_controller.rb

  def index
    @budgets = Budget.all
---
SELECT `budgets`.* FROM `budgets`

  def create
    @budget = Budget.new(budget_params)

    respond_to do |format|
      if @budget.save
---
INSERT INTO `budgets` (`name`, `purpose`, `source_of_fund`, `project_duration`, `amount`, `currency_id`, `created_at`, `updated_at`) VALUES ('Black Astrolope Budget', 'To buy new day old chicks', 'Personal', '6 months', 100.0, 1, '2022-04-22 10:16:13', '2022-04-22 10:16:13')

    def set_budget
      @budget = Budget.find(params[:id])
---
SELECT  `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 LIMIT 1