app/controllers/currencies_controller.rb

  def index
    @currencies = Currency.all
---
SELECT `currencies`.* FROM `currencies`

  def create
    @currency = Currency.new(currency_params)

    respond_to do |format|
      if @currency.save
---
INSERT INTO `currencies` (`name`, `rate`, `sysmbol`, `created_at`, `updated_at`) VALUES ('USD', 1, 'US$', '2022-04-21 09:14:59', '2022-04-21 09:14:59')

    def set_currency
      @currency = Currency.find(params[:id])
---
SELECT  `currencies`.* FROM `currencies` WHERE `currencies`.`id` = 1 LIMIT 1