app/controllers/expenses_controller.rb

SELECT `expenses`.* FROM `expenses`
---
  def index
    @expenses = Expense.all

INSERT INTO `expenses` (`name`, `quantity`, `price`, `currency_id`, `created_at`, `updated_at`) VALUES ('Transport to buy feed', '1', '5', 1, '2022-04-22 11:16:45', '2022-04-22 11:16:45')
---
  def create
    @expense = Expense.new(expense_params)

    respond_to do |format|
      if @expense.save

UPDATE `expenses` SET `code` = 'CEM001' WHERE `expenses`.`id` = 8
---
  def update
    respond_to do |format|
      if @expense.update(expense_params)

SELECT  `expenses`.* FROM `expenses` WHERE `expenses`.`id` = 8 LIMIT 1
---
    def set_expense
      @expense = Expense.find(params[:id])