app/controllers/feeds_controller.rb

  def index
    @feeds = Feed.all
---
SELECT `feeds`.* FROM `feeds`

  def create
    @feed = Feed.new(feed_params)

    respond_to do |format|
      if @feed.save
---
INSERT INTO `feeds` (`name`, `description`, `purpose`, `quantity`, `price`, `supplier`, `currency_id`, `created_at`, `updated_at`) VALUES ('Broiler Starter 50kg', 'Straight feed', 'Foe the broilers', '2', 26.7, 'Profeeds', 1, '2022-04-22 11:39:11', '2022-04-22 11:39:11')

  def update
    respond_to do |format|
      if @feed.update(feed_params)
---
UPDATE `feeds` SET `supplier` = 'Capital Feeds', `updated_at` = '2022-04-22 11:37:43' WHERE `feeds`.`id` = 1

    def set_feed
      @feed = Feed.find(params[:id])
---
SELECT  `feeds`.* FROM `feeds` WHERE `feeds`.`id` = 1 LIMIT 1