app/controllers/inventories_controller.rb

  def index
    @inventories = Inventory.all
---
SELECT `inventories`.* FROM `inventories`

  def create
    @inventory = Inventory.new(inventory_params)

    respond_to do |format|
      if @inventory.save
---
INSERT INTO `inventories` (`item_name`, `purpose`, `quantity`, `value`, `currency_id`, `expiry_date`, `created_at`, `updated_at`) VALUES ('Broiler Grower', 'For Broilers', '11', 27.0, 1, '2022-04-21', '2022-04-21 16:57:59', '2022-04-21 16:57:59')

    def set_inventory
      @inventory = Inventory.find(params[:id])
---
SELECT  `inventories`.* FROM `inventories` WHERE `inventories`.`id` = 1 LIMIT 1