app/controllers/payment_methods_controller.rb

SELECT `payment_methods`.* FROM `payment_methods`
---
  def index
    @payment_methods = PaymentMethod.all

INSERT INTO `payment_methods` (`name`, `created_at`, `updated_at`) VALUES ('Cash USD', '2022-04-20 14:00:17', '2022-04-20 14:00:17')
---
  def create
    @payment_method = PaymentMethod.new(payment_method_params)

    respond_to do |format|
      if @payment_method.save

SELECT  `payment_methods`.* FROM `payment_methods` WHERE `payment_methods`.`id` = 1 LIMIT 1
---
    def set_payment_method
      @payment_method = PaymentMethod.find(params[:id])