app/controllers/reports_controller.rb

  def costings
    @expense_categories = ExpenseCategory.all
---
SELECT `expense_categories`.* FROM `expense_categories`