app/controllers/sales_controller.rb

SELECT `sales`.* FROM `sales`
---
  def index
    @sales = Sale.all

INSERT INTO `sales` (`customer_name`, `item_purchased`, `quantity`, `price`, `payment_method_id`, `currency_id`, `day`, `created_at`, `updated_at`) VALUES ('Anold Kupara', 'Broilers', '23', 6.0, 1, 1, '2022-04-21', '2022-04-21 16:42:42', '2022-04-21 16:42:42')
---
  def create
    @sale = Sale.new(sale_params)

    respond_to do |format|
      if @sale.save

DELETE FROM `sales` WHERE `sales`.`id` = 1
---
  def destroy
    @sale.destroy

SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
---
    def set_sale
      @sale = Sale.find(params[:id])