app/controllers/vaccines_controller.rb

SELECT `vaccines`.* FROM `vaccines`
---
  def index
    @vaccines = Vaccine.all

INSERT INTO `vaccines` (`name`, `description`, `purpose`, `alternative`, `expiry_date`, `quantity`, `currency_id`, `created_at`, `updated_at`) VALUES ('Stress Pack', '', '21', 'Sugar', '2022-04-22', '12', 1, '2022-04-22 12:06:12', '2022-04-22 12:06:12')
---
  def create
    @vaccine = Vaccine.new(vaccine_params)

    respond_to do |format|
      if @vaccine.save

UPDATE `vaccines` SET `purpose` = 'For the broilers', `quantity` = '1', `price` = 4.0, `updated_at` = '2022-04-22 12:07:56' WHERE `vaccines`.`id` = 1
---
  def update
    respond_to do |format|
      if @vaccine.update(vaccine_params)

SELECT  `vaccines`.* FROM `vaccines` WHERE `vaccines`.`id` = 1 LIMIT 1
---
    def set_vaccine
      @vaccine = Vaccine.find(params[:id])