app/views/sales/_form.html.erb

SELECT `payment_methods`.* FROM `payment_methods`
---
              <%= form.label :payment_method_id, class: "form-label"  %>
              <%= form.select :payment_method_id, PaymentMethod.all.collect {|p| [p.name, p.id]}, {prompt: "Select Payment Method"}, class: "form-select form-select-lg" %>

SELECT `currencies`.* FROM `currencies`
---
            <%= form.label :currency_id, class: "form-label"  %>
            <%= form.select :currency_id, Currency.all.collect {|c| [c.name, c.id]}, {prompt: "Select Currency"}, class: "form-select form-select-lg" %>