app/views/reports/costings.html.erb

			<% category.expenses.each_with_index do |expense,x| %>
				<% unless expense.expense_transactions.empty? %>
---
SELECT  1 AS one FROM `expense_transactions` WHERE `expense_transactions`.`expense_id` = 3 LIMIT 1